testing/results/canvas-20260509-075303/k6-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/ubuntu/canvas-k8s/testing/load_test/canvas-load.js
        output: Prometheus remote write (http://172.31.27.241:30090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 10 max VUs, 5m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 5m0s (gracefulStop: 30s)


Run       [ 100% ] setup()
default   [   0% ]

running (0m02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 10 VUs  0m00.4s/5m0s

running (0m03.0s), 10/10 VUs, 3 complete and 0 interrupted iterations
default   [   0% ] 10 VUs  0m01.4s/5m0s

running (0m04.0s), 10/10 VUs, 9 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m02.4s/5m0s

running (0m05.0s), 10/10 VUs, 17 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m03.4s/5m0s

running (0m06.0s), 10/10 VUs, 24 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m04.4s/5m0s

running (0m07.0s), 10/10 VUs, 31 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m05.4s/5m0s

running (0m08.0s), 10/10 VUs, 38 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m06.4s/5m0s

running (0m09.0s), 10/10 VUs, 42 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m07.4s/5m0s

running (0m10.0s), 10/10 VUs, 52 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m08.4s/5m0s

running (0m11.0s), 10/10 VUs, 57 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m09.4s/5m0s

running (0m12.0s), 10/10 VUs, 65 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m10.4s/5m0s

running (0m13.0s), 10/10 VUs, 72 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m11.4s/5m0s

running (0m14.0s), 10/10 VUs, 81 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m12.4s/5m0s

running (0m15.0s), 10/10 VUs, 88 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m13.4s/5m0s

running (0m16.0s), 10/10 VUs, 93 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m14.4s/5m0s

running (0m17.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m15.4s/5m0s

running (0m18.0s), 10/10 VUs, 107 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m16.4s/5m0s

running (0m19.0s), 10/10 VUs, 117 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m17.4s/5m0s

running (0m20.0s), 10/10 VUs, 123 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m18.4s/5m0s

running (0m21.0s), 10/10 VUs, 129 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m19.4s/5m0s

running (0m22.0s), 10/10 VUs, 138 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m20.4s/5m0s

running (0m23.0s), 10/10 VUs, 145 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m21.4s/5m0s

running (0m24.0s), 10/10 VUs, 152 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m22.4s/5m0s

running (0m25.0s), 10/10 VUs, 157 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m23.4s/5m0s

running (0m26.0s), 10/10 VUs, 165 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m24.4s/5m0s

running (0m27.0s), 10/10 VUs, 171 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m25.4s/5m0s

running (0m28.0s), 10/10 VUs, 181 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m26.4s/5m0s

running (0m29.0s), 10/10 VUs, 187 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m27.4s/5m0s

running (0m30.0s), 10/10 VUs, 195 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m28.4s/5m0s

running (0m31.0s), 10/10 VUs, 199 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m29.4s/5m0s

running (0m32.0s), 10/10 VUs, 208 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m30.4s/5m0s

running (0m33.0s), 10/10 VUs, 216 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m31.4s/5m0s

running (0m34.0s), 10/10 VUs, 224 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m32.4s/5m0s

running (0m35.0s), 10/10 VUs, 230 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m33.4s/5m0s

running (0m36.0s), 10/10 VUs, 238 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m34.4s/5m0s

running (0m37.0s), 10/10 VUs, 242 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m35.4s/5m0s

running (0m38.0s), 10/10 VUs, 249 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m36.4s/5m0s

running (0m39.0s), 10/10 VUs, 257 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m37.4s/5m0s

running (0m40.0s), 10/10 VUs, 265 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m38.4s/5m0s

running (0m41.0s), 10/10 VUs, 271 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m39.4s/5m0s

running (0m42.0s), 10/10 VUs, 278 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m40.4s/5m0s

running (0m43.0s), 10/10 VUs, 283 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m41.4s/5m0s

running (0m44.0s), 10/10 VUs, 291 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m42.4s/5m0s

running (0m45.0s), 10/10 VUs, 299 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m43.4s/5m0s

running (0m46.0s), 10/10 VUs, 306 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m44.4s/5m0s

running (0m47.0s), 10/10 VUs, 313 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m45.4s/5m0s

running (0m48.0s), 10/10 VUs, 322 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m46.4s/5m0s

running (0m49.0s), 10/10 VUs, 327 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m47.4s/5m0s

running (0m50.0s), 10/10 VUs, 334 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m48.4s/5m0s

running (0m51.0s), 10/10 VUs, 342 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m49.4s/5m0s

running (0m52.0s), 10/10 VUs, 352 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m50.4s/5m0s

running (0m53.0s), 10/10 VUs, 358 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m51.4s/5m0s

running (0m54.0s), 10/10 VUs, 363 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m52.4s/5m0s

running (0m55.0s), 10/10 VUs, 369 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m53.4s/5m0s

running (0m56.0s), 10/10 VUs, 378 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m54.4s/5m0s

running (0m57.0s), 10/10 VUs, 385 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m55.4s/5m0s

running (0m58.0s), 10/10 VUs, 390 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m56.4s/5m0s

running (0m59.0s), 10/10 VUs, 397 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m57.4s/5m0s

running (1m00.0s), 10/10 VUs, 403 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m58.4s/5m0s

running (1m01.0s), 10/10 VUs, 411 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m59.4s/5m0s

running (1m02.0s), 10/10 VUs, 417 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  1m00.4s/5m0s

running (1m03.0s), 10/10 VUs, 426 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  1m01.4s/5m0s

running (1m04.0s), 10/10 VUs, 432 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  1m02.4s/5m0s

running (1m05.0s), 10/10 VUs, 438 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  1m03.4s/5m0s

running (1m06.0s), 10/10 VUs, 448 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  1m04.4s/5m0s

running (1m07.0s), 10/10 VUs, 455 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  1m05.4s/5m0s

running (1m08.0s), 10/10 VUs, 460 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  1m06.4s/5m0s

running (1m09.0s), 10/10 VUs, 470 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  1m07.4s/5m0s

running (1m10.0s), 10/10 VUs, 477 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  1m08.4s/5m0s

running (1m11.0s), 10/10 VUs, 485 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  1m09.4s/5m0s

running (1m12.0s), 10/10 VUs, 488 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  1m10.4s/5m0s

running (1m13.0s), 10/10 VUs, 496 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  1m11.4s/5m0s

running (1m14.0s), 10/10 VUs, 505 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  1m12.4s/5m0s

running (1m15.0s), 10/10 VUs, 513 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  1m13.4s/5m0s

running (1m16.0s), 10/10 VUs, 522 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  1m14.4s/5m0s

running (1m17.0s), 10/10 VUs, 529 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  1m15.4s/5m0s

running (1m18.0s), 10/10 VUs, 536 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  1m16.4s/5m0s

running (1m19.0s), 10/10 VUs, 544 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  1m17.4s/5m0s

running (1m20.0s), 10/10 VUs, 551 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  1m18.4s/5m0s

running (1m21.0s), 10/10 VUs, 558 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  1m19.4s/5m0s

running (1m22.0s), 10/10 VUs, 567 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  1m20.4s/5m0s

running (1m23.0s), 10/10 VUs, 575 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  1m21.4s/5m0s

running (1m24.0s), 10/10 VUs, 582 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  1m22.4s/5m0s

running (1m25.0s), 10/10 VUs, 590 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  1m23.4s/5m0s

running (1m26.0s), 10/10 VUs, 597 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  1m24.4s/5m0s

running (1m27.0s), 10/10 VUs, 604 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  1m25.4s/5m0s

running (1m28.0s), 10/10 VUs, 611 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  1m26.4s/5m0s

running (1m29.0s), 10/10 VUs, 619 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  1m27.4s/5m0s

running (1m30.0s), 10/10 VUs, 628 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  1m28.4s/5m0s

running (1m31.0s), 10/10 VUs, 635 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  1m29.4s/5m0s

running (1m32.0s), 10/10 VUs, 642 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  1m30.4s/5m0s

running (1m33.0s), 10/10 VUs, 649 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  1m31.4s/5m0s

running (1m34.0s), 10/10 VUs, 659 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  1m32.4s/5m0s

running (1m35.0s), 10/10 VUs, 663 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  1m33.4s/5m0s

running (1m36.0s), 10/10 VUs, 671 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  1m34.4s/5m0s

running (1m37.0s), 10/10 VUs, 682 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  1m35.4s/5m0s

running (1m38.0s), 10/10 VUs, 689 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  1m36.4s/5m0s

running (1m39.0s), 10/10 VUs, 698 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  1m37.4s/5m0s

running (1m40.0s), 10/10 VUs, 707 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  1m38.4s/5m0s

running (1m41.0s), 10/10 VUs, 711 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  1m39.4s/5m0s

running (1m42.0s), 10/10 VUs, 719 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  1m40.4s/5m0s

running (1m43.0s), 10/10 VUs, 729 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  1m41.4s/5m0s

running (1m44.0s), 10/10 VUs, 737 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  1m42.4s/5m0s

running (1m45.0s), 10/10 VUs, 742 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  1m43.4s/5m0s

running (1m46.0s), 10/10 VUs, 751 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  1m44.4s/5m0s

running (1m47.0s), 10/10 VUs, 762 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  1m45.4s/5m0s

running (1m48.0s), 10/10 VUs, 769 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  1m46.4s/5m0s

running (1m49.0s), 10/10 VUs, 778 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  1m47.4s/5m0s

running (1m50.0s), 10/10 VUs, 786 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  1m48.4s/5m0s

running (1m51.0s), 10/10 VUs, 791 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  1m49.4s/5m0s

running (1m52.0s), 10/10 VUs, 801 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  1m50.4s/5m0s

running (1m53.0s), 10/10 VUs, 806 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  1m51.4s/5m0s

running (1m54.0s), 10/10 VUs, 815 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  1m52.4s/5m0s

running (1m55.0s), 10/10 VUs, 822 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  1m53.4s/5m0s

running (1m56.0s), 10/10 VUs, 831 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  1m54.4s/5m0s

running (1m57.0s), 10/10 VUs, 838 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  1m55.4s/5m0s

running (1m58.0s), 10/10 VUs, 845 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  1m56.4s/5m0s

running (1m59.0s), 10/10 VUs, 853 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  1m57.4s/5m0s

running (2m00.0s), 10/10 VUs, 860 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  1m58.4s/5m0s

running (2m01.0s), 10/10 VUs, 867 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  1m59.4s/5m0s

running (2m02.0s), 10/10 VUs, 875 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  2m00.4s/5m0s

running (2m03.0s), 10/10 VUs, 884 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  2m01.4s/5m0s

running (2m04.0s), 10/10 VUs, 890 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  2m02.4s/5m0s

running (2m05.0s), 10/10 VUs, 900 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  2m03.4s/5m0s

running (2m06.0s), 10/10 VUs, 906 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  2m04.4s/5m0s

running (2m07.0s), 10/10 VUs, 912 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  2m05.4s/5m0s

running (2m08.0s), 10/10 VUs, 922 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  2m06.4s/5m0s

running (2m09.0s), 10/10 VUs, 928 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  2m07.4s/5m0s

running (2m10.0s), 10/10 VUs, 935 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  2m08.4s/5m0s

running (2m11.0s), 10/10 VUs, 944 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  2m09.4s/5m0s

running (2m12.0s), 10/10 VUs, 949 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  2m10.4s/5m0s

running (2m13.0s), 10/10 VUs, 956 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  2m11.4s/5m0s

running (2m14.0s), 10/10 VUs, 964 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  2m12.4s/5m0s

running (2m15.0s), 10/10 VUs, 970 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  2m13.4s/5m0s

running (2m16.0s), 10/10 VUs, 978 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  2m14.4s/5m0s

running (2m17.0s), 10/10 VUs, 989 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  2m15.4s/5m0s

running (2m18.0s), 10/10 VUs, 996 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  2m16.4s/5m0s

running (2m19.0s), 10/10 VUs, 1004 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  2m17.4s/5m0s

running (2m20.0s), 10/10 VUs, 1010 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  2m18.4s/5m0s

running (2m21.0s), 10/10 VUs, 1019 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  2m19.4s/5m0s

running (2m22.0s), 10/10 VUs, 1025 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  2m20.4s/5m0s

running (2m23.0s), 10/10 VUs, 1035 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  2m21.4s/5m0s

running (2m24.0s), 10/10 VUs, 1040 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  2m22.4s/5m0s

running (2m25.0s), 10/10 VUs, 1046 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  2m23.4s/5m0s

running (2m26.0s), 10/10 VUs, 1053 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  2m24.4s/5m0s

running (2m27.0s), 10/10 VUs, 1061 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  2m25.4s/5m0s

running (2m28.0s), 10/10 VUs, 1069 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  2m26.4s/5m0s

running (2m29.0s), 10/10 VUs, 1075 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  2m27.4s/5m0s

running (2m30.0s), 10/10 VUs, 1082 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  2m28.4s/5m0s

running (2m31.0s), 10/10 VUs, 1092 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  2m29.4s/5m0s

running (2m32.0s), 10/10 VUs, 1097 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  2m30.4s/5m0s

running (2m33.0s), 10/10 VUs, 1106 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  2m31.4s/5m0s

running (2m34.0s), 10/10 VUs, 1112 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  2m32.4s/5m0s

running (2m35.0s), 10/10 VUs, 1119 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  2m33.4s/5m0s

running (2m36.0s), 10/10 VUs, 1127 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  2m34.4s/5m0s

running (2m37.0s), 10/10 VUs, 1135 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  2m35.4s/5m0s

running (2m38.0s), 10/10 VUs, 1141 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  2m36.4s/5m0s

running (2m39.0s), 10/10 VUs, 1149 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  2m37.4s/5m0s

running (2m40.0s), 10/10 VUs, 1156 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  2m38.4s/5m0s

running (2m41.0s), 10/10 VUs, 1162 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  2m39.4s/5m0s

running (2m42.0s), 10/10 VUs, 1169 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  2m40.4s/5m0s

running (2m43.0s), 10/10 VUs, 1176 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  2m41.4s/5m0s

running (2m44.0s), 10/10 VUs, 1184 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  2m42.4s/5m0s

running (2m45.0s), 10/10 VUs, 1189 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  2m43.4s/5m0s

running (2m46.0s), 10/10 VUs, 1197 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  2m44.4s/5m0s

running (2m47.0s), 10/10 VUs, 1204 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  2m45.4s/5m0s

running (2m48.0s), 10/10 VUs, 1213 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  2m46.4s/5m0s

running (2m49.0s), 10/10 VUs, 1220 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  2m47.4s/5m0s

running (2m50.0s), 10/10 VUs, 1230 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  2m48.4s/5m0s

running (2m51.0s), 10/10 VUs, 1237 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  2m49.4s/5m0s

running (2m52.0s), 10/10 VUs, 1244 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  2m50.4s/5m0s

running (2m53.0s), 10/10 VUs, 1250 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  2m51.4s/5m0s

running (2m54.0s), 10/10 VUs, 1257 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  2m52.4s/5m0s

running (2m55.0s), 10/10 VUs, 1265 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  2m53.4s/5m0s

running (2m56.0s), 10/10 VUs, 1273 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  2m54.4s/5m0s

running (2m57.0s), 10/10 VUs, 1281 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  2m55.4s/5m0s

running (2m58.0s), 10/10 VUs, 1289 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  2m56.4s/5m0s

running (2m59.0s), 10/10 VUs, 1297 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  2m57.4s/5m0s

running (3m00.0s), 10/10 VUs, 1305 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  2m58.4s/5m0s

running (3m01.0s), 10/10 VUs, 1311 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  2m59.4s/5m0s

running (3m02.0s), 10/10 VUs, 1317 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  3m00.4s/5m0s

running (3m03.0s), 10/10 VUs, 1327 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  3m01.4s/5m0s

running (3m04.0s), 10/10 VUs, 1334 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  3m02.4s/5m0s

running (3m05.0s), 10/10 VUs, 1342 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  3m03.4s/5m0s

running (3m06.0s), 10/10 VUs, 1350 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  3m04.4s/5m0s

running (3m07.0s), 10/10 VUs, 1357 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  3m05.4s/5m0s

running (3m08.0s), 10/10 VUs, 1365 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  3m06.4s/5m0s

running (3m09.0s), 10/10 VUs, 1375 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  3m07.4s/5m0s

running (3m10.0s), 10/10 VUs, 1379 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  3m08.4s/5m0s

running (3m11.0s), 10/10 VUs, 1387 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  3m09.4s/5m0s

running (3m12.0s), 10/10 VUs, 1394 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  3m10.4s/5m0s

running (3m13.0s), 10/10 VUs, 1400 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  3m11.4s/5m0s

running (3m14.0s), 10/10 VUs, 1410 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  3m12.4s/5m0s

running (3m15.0s), 10/10 VUs, 1417 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  3m13.4s/5m0s

running (3m16.0s), 10/10 VUs, 1423 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  3m14.4s/5m0s

running (3m17.0s), 10/10 VUs, 1431 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  3m15.4s/5m0s

running (3m18.0s), 10/10 VUs, 1437 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  3m16.4s/5m0s

running (3m19.0s), 10/10 VUs, 1444 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  3m17.4s/5m0s

running (3m20.0s), 10/10 VUs, 1453 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  3m18.4s/5m0s

running (3m21.0s), 10/10 VUs, 1460 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  3m19.4s/5m0s

running (3m22.0s), 10/10 VUs, 1468 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  3m20.4s/5m0s

running (3m23.0s), 10/10 VUs, 1476 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  3m21.4s/5m0s

running (3m24.0s), 10/10 VUs, 1483 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  3m22.4s/5m0s

running (3m25.0s), 10/10 VUs, 1491 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  3m23.4s/5m0s

running (3m26.0s), 10/10 VUs, 1498 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  3m24.4s/5m0s

running (3m27.0s), 10/10 VUs, 1508 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  3m25.4s/5m0s

running (3m28.0s), 10/10 VUs, 1513 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  3m26.4s/5m0s

running (3m29.0s), 10/10 VUs, 1519 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  3m27.4s/5m0s

running (3m30.0s), 10/10 VUs, 1525 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  3m28.4s/5m0s

running (3m31.0s), 10/10 VUs, 1532 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  3m29.4s/5m0s

running (3m32.0s), 10/10 VUs, 1539 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  3m30.4s/5m0s

running (3m33.0s), 10/10 VUs, 1548 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  3m31.4s/5m0s

running (3m34.0s), 10/10 VUs, 1554 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  3m32.4s/5m0s

running (3m35.0s), 10/10 VUs, 1564 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  3m33.4s/5m0s

running (3m36.0s), 10/10 VUs, 1572 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  3m34.4s/5m0s

running (3m37.0s), 10/10 VUs, 1577 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  3m35.4s/5m0s

running (3m38.0s), 10/10 VUs, 1584 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  3m36.4s/5m0s

running (3m39.0s), 10/10 VUs, 1591 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  3m37.4s/5m0s

running (3m40.0s), 10/10 VUs, 1598 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  3m38.4s/5m0s

running (3m41.0s), 10/10 VUs, 1602 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  3m39.4s/5m0s

running (3m42.0s), 10/10 VUs, 1610 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  3m40.4s/5m0s

running (3m43.0s), 10/10 VUs, 1618 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  3m41.4s/5m0s

running (3m44.0s), 10/10 VUs, 1628 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  3m42.4s/5m0s

running (3m45.0s), 10/10 VUs, 1631 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  3m43.4s/5m0s

running (3m46.0s), 10/10 VUs, 1641 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  3m44.4s/5m0s

running (3m47.0s), 10/10 VUs, 1648 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  3m45.4s/5m0s

running (3m48.0s), 10/10 VUs, 1655 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  3m46.4s/5m0s

running (3m49.0s), 10/10 VUs, 1664 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  3m47.4s/5m0s

running (3m50.0s), 10/10 VUs, 1671 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  3m48.4s/5m0s

running (3m51.0s), 10/10 VUs, 1679 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  3m49.4s/5m0s

running (3m52.0s), 10/10 VUs, 1687 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  3m50.4s/5m0s

running (3m53.0s), 10/10 VUs, 1695 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  3m51.4s/5m0s

running (3m54.0s), 10/10 VUs, 1703 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  3m52.4s/5m0s

running (3m55.0s), 10/10 VUs, 1711 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  3m53.4s/5m0s

running (3m56.0s), 10/10 VUs, 1721 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  3m54.4s/5m0s

running (3m57.0s), 10/10 VUs, 1727 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  3m55.4s/5m0s

running (3m58.0s), 10/10 VUs, 1734 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  3m56.4s/5m0s

running (3m59.0s), 10/10 VUs, 1740 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  3m57.4s/5m0s

running (4m00.0s), 10/10 VUs, 1749 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  3m58.4s/5m0s

running (4m01.0s), 10/10 VUs, 1759 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  3m59.4s/5m0s

running (4m02.0s), 10/10 VUs, 1766 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  4m00.4s/5m0s

running (4m03.0s), 10/10 VUs, 1773 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  4m01.4s/5m0s

running (4m04.0s), 10/10 VUs, 1780 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  4m02.4s/5m0s

running (4m05.0s), 10/10 VUs, 1789 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  4m03.4s/5m0s

running (4m06.0s), 10/10 VUs, 1795 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  4m04.4s/5m0s

running (4m07.0s), 10/10 VUs, 1804 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  4m05.4s/5m0s

running (4m08.0s), 10/10 VUs, 1810 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  4m06.4s/5m0s

running (4m09.0s), 10/10 VUs, 1819 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  4m07.4s/5m0s

running (4m10.0s), 10/10 VUs, 1827 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  4m08.4s/5m0s

running (4m11.0s), 10/10 VUs, 1831 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  4m09.4s/5m0s

running (4m12.0s), 10/10 VUs, 1837 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  4m10.4s/5m0s

running (4m13.0s), 10/10 VUs, 1845 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  4m11.4s/5m0s

running (4m14.0s), 10/10 VUs, 1852 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  4m12.4s/5m0s

running (4m15.0s), 10/10 VUs, 1862 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  4m13.4s/5m0s

running (4m16.0s), 10/10 VUs, 1868 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  4m14.4s/5m0s

running (4m17.0s), 10/10 VUs, 1875 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  4m15.4s/5m0s

running (4m18.0s), 10/10 VUs, 1881 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  4m16.4s/5m0s

running (4m19.0s), 10/10 VUs, 1889 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  4m17.4s/5m0s

running (4m20.0s), 10/10 VUs, 1895 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  4m18.4s/5m0s

running (4m21.0s), 10/10 VUs, 1904 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  4m19.4s/5m0s

running (4m22.0s), 10/10 VUs, 1913 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  4m20.4s/5m0s

running (4m23.0s), 10/10 VUs, 1921 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  4m21.4s/5m0s

running (4m24.0s), 10/10 VUs, 1927 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  4m22.4s/5m0s

running (4m25.0s), 10/10 VUs, 1935 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  4m23.4s/5m0s

running (4m26.0s), 10/10 VUs, 1945 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  4m24.4s/5m0s

running (4m27.0s), 10/10 VUs, 1949 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  4m25.4s/5m0s

running (4m28.0s), 10/10 VUs, 1960 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  4m26.4s/5m0s

running (4m29.0s), 10/10 VUs, 1966 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  4m27.4s/5m0s

running (4m30.0s), 10/10 VUs, 1974 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  4m28.4s/5m0s

running (4m31.0s), 10/10 VUs, 1981 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  4m29.4s/5m0s

running (4m32.0s), 10/10 VUs, 1987 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  4m30.4s/5m0s

running (4m33.0s), 10/10 VUs, 1996 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  4m31.4s/5m0s

running (4m34.0s), 10/10 VUs, 2001 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  4m32.4s/5m0s

running (4m35.0s), 10/10 VUs, 2009 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  4m33.4s/5m0s

running (4m36.0s), 10/10 VUs, 2016 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  4m34.4s/5m0s

running (4m37.0s), 10/10 VUs, 2024 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  4m35.4s/5m0s

running (4m38.0s), 10/10 VUs, 2033 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  4m36.4s/5m0s

running (4m39.0s), 10/10 VUs, 2042 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  4m37.4s/5m0s

running (4m40.0s), 10/10 VUs, 2051 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  4m38.4s/5m0s

running (4m41.0s), 10/10 VUs, 2054 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  4m39.4s/5m0s

running (4m42.0s), 10/10 VUs, 2065 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  4m40.4s/5m0s

running (4m43.0s), 10/10 VUs, 2070 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  4m41.4s/5m0s

running (4m44.0s), 10/10 VUs, 2078 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  4m42.4s/5m0s

running (4m45.0s), 10/10 VUs, 2087 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  4m43.4s/5m0s

running (4m46.0s), 10/10 VUs, 2095 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  4m44.4s/5m0s

running (4m47.0s), 10/10 VUs, 2101 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  4m45.4s/5m0s

running (4m48.0s), 10/10 VUs, 2108 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  4m46.4s/5m0s

running (4m49.0s), 10/10 VUs, 2117 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  4m47.4s/5m0s

running (4m50.0s), 10/10 VUs, 2123 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  4m48.4s/5m0s

running (4m51.0s), 10/10 VUs, 2130 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  4m49.4s/5m0s

running (4m52.0s), 10/10 VUs, 2138 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  4m50.4s/5m0s

running (4m53.0s), 10/10 VUs, 2144 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  4m51.4s/5m0s

running (4m54.0s), 10/10 VUs, 2151 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  4m52.4s/5m0s

running (4m55.0s), 10/10 VUs, 2159 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  4m53.4s/5m0s

running (4m56.0s), 10/10 VUs, 2164 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  4m54.4s/5m0s

running (4m57.0s), 10/10 VUs, 2173 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  4m55.4s/5m0s

running (4m58.0s), 10/10 VUs, 2183 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  4m56.4s/5m0s

running (4m59.0s), 10/10 VUs, 2188 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  4m57.4s/5m0s

running (5m00.0s), 10/10 VUs, 2197 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  4m58.4s/5m0s

running (5m01.0s), 10/10 VUs, 2202 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  4m59.4s/5m0s

running (5m02.0s), 06/10 VUs, 2211 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  5m0s

running (5m03.0s), 01/10 VUs, 2216 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  5m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<3000' p(95)=222.15ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 2234    7.363253/s
    checks_succeeded...: 100.00% 2234 out of 2234
    checks_failed......: 0.00%   0 out of 2234

    ✓ /api/v1/accounts/self/courses status is 200
    ✓ /api/v1/courses/15/assignments status is 200
    ✓ /api/v1/courses/15/quizzes status is 200
    ✓ /api/v1/courses/16/assignments status is 200
    ✓ /api/v1/courses/16/quizzes status is 200
    ✓ /api/v1/courses/17/assignments status is 200
    ✓ /api/v1/courses/17/quizzes status is 200
    ✓ /api/v1/courses/18/assignments status is 200
    ✓ /api/v1/courses/18/quizzes status is 200
    ✓ /api/v1/courses/19/assignments status is 200
    ✓ /api/v1/courses/19/quizzes status is 200
    ✓ /api/v1/courses/20/assignments status is 200
    ✓ /api/v1/courses/20/quizzes status is 200
    ✓ /api/v1/courses/21/assignments status is 200
    ✓ /api/v1/courses/21/quizzes status is 200
    ✓ /api/v1/courses/22/assignments status is 200
    ✓ /api/v1/courses/22/quizzes status is 200
    ✓ assignments status is 200
    ✓ courses status is 200
    ✓ quizzes status is 200
    ✓ submission status is successful
    ✓ modules status is 200

    HTTP
    http_req_duration..............: avg=112.2ms min=25.82ms  med=85.42ms max=1.02s p(90)=178.36ms p(95)=222.15ms p(99)=367.59ms
      { expected_response:true }...: avg=112.2ms min=25.82ms  med=85.42ms max=1.02s p(90)=178.36ms p(95)=222.15ms p(99)=367.59ms
    http_req_failed................: 0.00%  0 out of 2234
    http_reqs......................: 2234   7.363253/s

    EXECUTION
    iteration_duration.............: avg=1.35s   min=533.69ms med=1.35s   max=2.72s p(90)=1.95s    p(95)=2.03s    p(99)=2.13s   
    iterations.....................: 2217   7.307221/s
    vus............................: 1      min=0         max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 27 MB  90 kB/s
    data_sent......................: 616 kB 2.0 kB/s



running (5m03.4s), 00/10 VUs, 2217 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  5m0s